[["Can u suggest me a good car racing game?"], ["I have to agree, I LOVED The Crew, but The Crew 2 imo is barely more than a demo of the Crew with boats and planes slapped on top. I feel like they took everything that was great about The Crew and scrapped it, and sold what was left."], ["I agree, the game is very underwhelming, and all the characters in this game are proof that Ubisoft has never seen a modern young person before. However, levelling up is really easy, and making money is easy too, so I don't know what you're talking about there. Or maybe I just found it easy. But overall, this game is just so empty and bland."], ["Also the driving is terrible, cars don't feel like cars."], ["I’ve had many great sessions with The Crew 2 and I got to say it’s a great game. Yes, loading in the beginning takes time and the music is shitty, but I have never had a problem with the game crashing."], ["I would disagree with nearly all of your points. Most of them seem to be subjective anyways.\n\nThe Crew 2 is a great beginner game for people looking to get into racing games. It's got a simple interface, basic things to do, and a pretty good range of cars, bikes, boats, and planes. As someone who's only played the 2005 NFS Most Wanted, it was a great reintroduction for me into the more modern racing games.\n\nYou can get a good 80-90 hours of playtime if you do all the races and try all the race styles equally, instead of just doing the street races and hypercar races. Personally, I've found Drift events, Rally Cross events, and the boat races really fun.\n\nThe only things I would say against this game are the shitty AI and the lack of component customisation. The AI is super unfair, unless you're a lot of levels above them. I've found AI cars crashing into me and blocking me so frequently that I gave up the game for a bit. Additionally, you can't really change engine parts, or wheel parts like tires etc, or transmissions, etc. You DO have a lot of cosmetic customisation, and most of it is really really well done.\n\nThe biggest turn off is the lack of content beyond a certain point. I've played about 110 hours, and beyond about 90 hours, you'll only enjoy if you hqve friends to play with, or you're super into the weekly things. PvP is quite sparse, and it's full of people who enjoy ramming your car off track instead of driving cleanly."], ["The crew 2 is trash for me too, the car driving is absolutely awful compared to other racing games such as nfs or forza"], ["HEY! Far Cry 5 music isn't shitty."], ["I haven’t tried it on PC, but I bought it at release on PS4, what a mistake. I enjoyed the first one a lot and the only issues I found with that game were that the driving physics were kinda janky and when playing online with friends, sometimes your friends cars simply wouldn’t show up and you just see there floating name so it’d be a pain to get started. The crew 2 took an even bigger dump on driving physics imo and I found it unplayable, in fact I stopped playing and didn’t even make it through the story. The world felt worse somehow, even though it was the same overall map as the first one. I genuinely couldn’t find enjoyment in this game which is a shame as it looks like they’ve supported it well with vehicles and game modes, but I have no intention of going back to it. I haven’t tried Heat yet as I’m waiting for it to hit game pass next week but every recent NFS game up till now has also just been bad. The Forza Horizon series are the best racing games I’ve ever played, because nothing feels broken. The driving physics are great, the world is fun to drive around and it is really easy to jump into. That’s my benchmark for racing games and ever since I first tried Horizon 3, the only thing that’s come close to it is Horizon 4."], ["Bought it on sale for 30€\n\nPlayed it for half and hour and refunded it.\n\nTerrible car controls, not so good graphics and at the end of a race it crashed, never opened again\n\nIts just Ubisoft things, wish them luck releasing games everywhere but on steam"], ["Disagree.\n\nI have played 100s of hours of crew 2. Loved the long trip from Miami to Seattle or NY to LA.\n\nI don't play that anymore but a new update supposed to drop tomorrow. So I will check that out.\n\nIf someone doesn't like something, it mustn't mean none should. Sorry."], ["I had no crashing Problems but i can only reinforce your opinion, its a very boring and grindy Game. It feels like a F2p but with wasted money on top. I was very exited for it to come out but it Was boring After 2 weeks, just like Nfs heat. My only Racing Game i still play very often is forza horizon 4,altough i achieved almost evrything. Fh4 is the way to go"], ["Agreed. It's really bad. \n\nI wasn't a huge fan of the first game but I thought well since the map is basically allready there they might have had time to focus on graphics and gameplay quality. \n\n\nThey didn't...\n\nSomehow both got worse"], ["Literally the worst case of rubberbanding I have ever seen. I could not even finish the first real race because of it. Surprised I haven't seen this here yet."], ["If you did buy it on steam, and played less than an hour, you can get a refund...I mean most people know this but just putting it out there"], ["Stupid floor it entire time game."], ["I was in the beta. I quit and uninstalled after seeing there was no option to go above 60fps. It was frame limited. Yes maybe that’s petty but I built a high end rig for a reason."], ["I can't agree, it never crashed for me, and yes you need to do races, that are maybe 4 minutes.\n\nI think you wanted to buy the most expensive car at the start of the game, you unlock harder versions of races that pay better, you can upgrade your car parts so you get more money.\n\nThe hud is bad, but you can disable the pop ups."], ["[deleted]"], ["I like it, but i play it on PS4. Bad PC maybe?"], ["While we’re at it, can anyone suggest me a good Mario Kart-type game?"], ["COMPLETELY AGREE. i spent $70 on the launch edition. one of the worst purchaces of my life."], ["The crew 1 is so much better"], ["It was a rocky start but once I got the feel for this game it became my favourite racing game. I think OP should take it how it is; a fun arcade racer with a ton of content. I found it awkward at first but the handling gets significantly better once you get better parts for your vehicles. After two months of playing straight crew 2 it makes nfs heat look anorexic.  I strongly disagree with OP."], ["I think some of these problems lie with you. Me and my friends have no problem navigating the UI, and in all the hours we've played I think I have only crashed once if at all."], ["agree with op. the crew 2 is garbage. Everything about it just feels idk, half finished. The bland open world and lack of pedestrians and other cars. I purchased it for 11 bucks on sale and grinded it out just so i could get the jesko. and when i finally did i stopped playing."], ["I had the crew one and it was trash. I was genuinely surprised they made a second."], ["What’s odd is that The Crew 1 was actually an ok game. Very rarely do you see a game’s sequel take such a step back like Ubisoft did with The Crew 2."], ["I disagree, it’s pure fun"], ["Completely disagree with op. The crew 2 is my favourite car game and its a bargain getting it that cheap. It has tons of cars and good entertaining late game content. Op is wrong."], ["I liked the game, but it's completely hampered by the usual Ubisoft live service formula. You're constantly doing the exact same thing you did for the entire game before the endgame, over and over and over again. I would have no issue with that, that's what endgame honestly is in most games, but most games actually do something with updates. If the updates actually introduced something new, I'd have no issue, but they don't. All of those \"updates\" to the game? There's nothing. You're going to do something you did for 40 hours before. There is zero creativity, just useless content fluff; filler. Same with The Division, same with The Crew. Riders Republic is going to have the exact same situation. I guarantee it. Just continous non-update updates.\n\nI have genuinely not seen a developer be so cowardly about doing even anything *remotely* unique or different in an update as Ubisoft. Complete these races, complete these events, collect these points, just ad naseum every update. Oh but now you can do all of that in this *new* shiny car!!!\n\nHow do people continue to be interested in these games?\n\nThe only thing I'll give them are the additional disciplines that they've added in updates, but they would be so monumentally difficult to implement in an update just like that, that there's no way in hell these were not planned from the start."], ["I played it on a free weekend once after i liked to screw around on the crew 1 for a while since it was free. \n\nI didnt care for it. The weather was weird and broke the immersion, and it felt horribly unoptimized. I might get it if it's ever free or super cheap on sale but eh..."], ["I agree with the the statements about the UI, it is difficult to navigate, but after a while you get used to it. But the performance of it u/Syixice is all on your end. I play Xbox one and it truly is a decent experience gameplay wise. Yeah there are the occasional chokes where it take a few seconds longer than normal to load but forza does that too. BUT IF YOURE LOOKING FOR MORE REALISTIC DRIVING PHYSICS, DO NOT BUY THIS GAME. Nitrous boosts and stupid easy drifting physics make it very arcade racer like, very much like the driving games you find in the arcade or bowling alley. Fun easy going game but sounds like it runs better on console.\n\n#oh and pressing Y in the crew DOES NOT REWIND"], ["I have it on PC, and I agree that the controls suck. I started playing with an Xbox controller, and it’s so much better. It’s still not good on some vehicles, but it is what it is. It’s a very grindy game when you’re getting started in each discipline, but it definitely gets easier as you go. You can look up which races/events give you the most money for the shortest amount of race time and essentially memorize those races. Like someone else said, it’s a pretty good entry level/beginner racing game. The graphics are decent imo, but that definitely depends on your GPU. I haven’t played The Crew, so I can’t compare it to #2. However, I don’t think The Crew 2 is necessarily a bad purchase given it’s only like $10-$15 on the uplay store. You get a decent amount of content for that price."], ["Sorry for bringing this thread back but I have to disagree. While it's not perfect it is the closest racing game next to midnight club la but with open world and better car sounds. Like with any car game you choose there will be pros and cons for certain features you want. Honestly I just bought TC2 and I loved every minute of it."], ["Every few months i log back into the crew 2 after 10mins remember why i quit this game and jump back to forza horizon 4"], ["I've had a lot of fun with it and would highly recommend anyone who loves open world racing to get this game. Don't know about any crashed since I played it on PS4."], ["I didn’t get on with The Crew. Regretted my choice of starter car, then you can’t earn enough money for a new car for a long, long time. When I finished, I looked at the trophies I needed to mop up and just decided not to bother, it’s over 100 hours to platinum."], ["I have three friends who play this game every single day, so, despite all that, very subjective, I don't think you should be telling people NOT to play it because the aesthetic feel isn't to your standards and it crashes on your PC."], ["It's super arcadey. It doesn't hide that fact though. It's fun when you dont want a serious racing sim, like iracing or assetto. It's not hard to progress through at all. As for the crashing, check your hardware and drivers; mine has been perfectly stable."], ["I mean I dont care about the story but I find it pretty enjoyable just driving around the map"], ["FYI there is a massive 4 hour demo for this game, so if it still sounds kinda Interesting just play that. You will get through all the fun stuff in those 4 hours and there is no point in buying the game after that"], ["I was on board until you said the far cry 5 music was shitty"], ["I agree this game is shit"], ["I think the crew is a fun game to play when you have a few minutes to kill. It's a lot of fun with friends because you can complete all the different races on the difference difficulty. As for the actual racing when you race with frit it's more of a competition between your friend and you even though if one of you win you both get rewards. If you played alone the races are super easy to beat. Which is why I can see why a lot of people don't like the game. Sight seeing in the game is also super fun. (Again my entire experience I played with a friend)"], ["lol bought it yesterday and i think its fun"], ["I got the first one free from Ubi30 event and really enjoyed it. I mostly played it with my friends and they loved the game too. Ubisoft gave The Crew 2 to me and one of my friends (why not both of them idk) for free. I downloaded it with hype (took 36 hours) and it was a huge disappointment for both of us.\n\nEverything was so flashy and frustrating. I hated the driving mechanics because it felt like I'm driving a box instead of a car.\n\nGame is still installed on my pc but I don't know if I'll give it a chance again."], ["I bought this game but it would not even luanch I refunded it"], ["I also had problems with the game crashing and after an intense search I found that turning V-Sync on seems to fix the crashes for most people (if I remember correctly, it was some time ago)"], ["Yeah, shit game but do you have child porn on your pc or why are you afraid of the anti-cheat? I wpuld rather have an \"intrusive\" anti-cheat than a useless one. BattlEye is completely safe tho, don't worry. I am a bit triggered by people that complain about anti-cheats like that because there are so many games that have not so \"intrusive\" anti-cheats and are useless and makes me think those people want to cheat"], ["I like the game"], ["I got the game because I wanted to ride bikes in an open world. man I regret choosing this one."], ["It’s insane how good racing games are hard to come by nowadays. It’s like someone told the developers of these games that they all had to be open world and had to have a melodramatic story associated with them. \n\nThat said, all the Dirt games are solid and definitely worth picking up if you ever see them on sale."], ["Couldn't you get this game for free on epic games a few weeks ago? I got it for free so i cant really complain about it not being worth the price"], ["Similarly, I bought it on sale and used an epic coupon to get gold for like 15 dollars or something. I know it wasn't going to be forza horizon 4 but it's hard to really compete with it.\n\nEverything about the game is just 'okay'. Drifting is fun once you get the hang, racing is okay, boats and planes are frustrating. I don't really feel compelled to play it as I was with forza. I know forza isn't realistic but driving in forza is just way better and feels more real. \n\nIt's probably so much fun to play with friends tbh"], ["I've never had problems with this game and I prefer it over forza. Just my 2 cents"], ["Unisoft, great concepts half the time, and horrible execution everytime.\n\nThey haven't made a game i love in so long, and i usually want to love them, due to very good old games, but their newer stuff just sucks."], ["I like the crew 2, may not be for some but it could be great for others."], ["i really enjoyed the crew. bought the crew 2 for like 15€ and was so damn disappointed"], ["Idk dude, I can be a fairly picky gamer and I’ve owned the crew 2 for maybe 2 years now and I find it pretty decent. Lots of cars to buy and many many things to over a variety of styles. During my play time I’ve completed the 4 mains styles to an average of maybe 88% completion and attained maybe 20-30 vehicles from all the disciplines. \n\nI play it on the ps4 and had little to no crashes so I cant really make a comment about that other than I know it sucks since I used to be a pc gamer. \n\n\nI think I bought my copy for around $30 when it was on sale and all in all my only real issue was the clunky handling when driving any vehicle, however now after this whole time I finally figured out that If you turn steering deadzone 1 up from minimum and turn steering linearity to just under half the cars generally handle better and less clunky\n\nIt’s not as fun as the crew one but I feel it was a good buy even at the $30 range as I’ve gotten many many hours of enjoyment for a low price"], ["Given the size of the game and things you can do, I think it was meant as a racing game for casual gamers. If you're into more hardcore race games you should have gone and bought asetta Corsa, project cars or just F1.\n\n And for the record 11$ for crew 2 is bang for buck, given the developers are still giving out new content after nearly 2 and half years since its release. And 15hrs is too little time to justify most of the flaws that you've stated."], ["Idk i just go on it if i want to drive around in the rain don't really care about anything else"], ["I’m absolutely ashamed to say I bought it for $60. It was a sad day."], ["Honestly I got the game at launch and I still play the game, and it’s the only game that doesn’t have brake to drift like nfs. If you have friends that like racing games too, then you’ll have a nice time racing and cruising through USA, I’m on PS4 that’s why I like the game since, there’s no good racing games that has realistic physics"], ["It's probably the worst racing game I bought. I'm not saying I don't like it, but the grind is far too much. It's impossible to unlock all of the cool stuff and parts are all RNG. If you don't play like every other week then you lose out on the exclusive rewards as well for the summits which are hard enough to win, to begin with. Really sucks because the actual single-player races were somewhat fun and it's good with a wheel tbh."], ["But the game has an amazing map and just riding with the boys is wholesome"], ["The game is only worth it for motorcycles."], ["In multiplayer mode demolition Derby is fun, the drifting is okay circuit stuff is ok, road racing bad, hover craft different and flying is bad."], ["I disagree with this.\n\nThe Crew 2 does a lot of things well, and whilst it has its problems, I think it does enough to earn a niche appeal within the racing games scene. \n\nThe Crew 2 is a great road trip game. Want to get in a fast car, drive for an hour through some scenic landscapes? Well, you can do that. It is in many ways similar to what made test drive unlimited so great, and whilst I prefer the recreation of Hawaii as it feels more realistic, the condensed greatest hits version of the USA in The Crew 2 offers a lot more variety, and allows for some great road trips. The addition of planes and boats feels underdeveloped, and I would've preferred that the developers just focused on the driving, but they can be a fun diversion and the planes offer a new way to experience the map, especially in places like monument valley.\n\nI've seen a lot of people suggest that Forza Horizon is better. Now, I'm not going to argue that Forza Horizon isn't the better racing game. The driving in Horizon is better, and whilst I enjoy the Crew 2s handling model, it can't beat Forza's for pure driving fun. \n\nThat said, I will say that the Crew 2 is the better game if you want to cruise and just go on road trips, as it has a much bigger map with more sights to see.\n\nAs for technical issues, I have had no problems on PC."], ["also the game has shit physics which are way too arcade like"], ["i bought it for like $14 and i have never had any problems with it and i enjoy it just as much as any other game"], ["Forza is way better anyway lmao, just buy Forza Horizon 4. That game's amazing."], ["I suggest you Gran Turismo Sport, Forza Horizon 4, Need for speed Heat"], ["Remember playing the Beta and couldn't get passed the intro, driving was fine, but as soon as I got into the plane, it didn't have a way to go up. Nothing worked. You could not physically fly up. So you just had to crash, get stuck in buildings, crash, or try to stay at the height it initially gives you, but that soons fails after you have to go higher to hit checkpoints. It was literally just straight up broken."], ["Reminds me of Anthem, I bought it for 11$ and after playing it for 40mins I realized I overpayed for the trash :("], ["Due to the crashes always being at around 40 mins id say it sounds like a overheating problem, maybe try to check tmos with msi afterburnner"], ["I genuinely enjoy the crew 2 it's just casual stupid fun also calling an ac out for reading files is just dumb also false ban claim is straight dumb their ac is similar to vac might miss some or even a lot time to time but never false bans. But yeah why the fuck does the crew 2 need it for ? I'm playing it on ps4 so not a bother for me but yeah a stupid decision especially when you can't even cheat the currency anyways."], ["Okay."], ["Should’ve just got need for speed heat or forza"], ["have it on ps4. its ight."], ["I finished that game completely in about 48 hours. not worth it."], ["I gave mk 11 for it, i didnt think staright"], ["Hm, I really enjoyed The Crew 2, not for everyone I suppose, nice with a steering wheel, mostly just spent the time drifting and driving around with my brother."], ["Just buy Forza Horizon 4 or 3. Both are better."], ["Woah wait, I've been playing TC2 since January and I really enjoyed it. So much that I can say it's one of my favourite racing games.  Btw, I've got i5 7600 (non-K) and GTX 1060 6gb."], ["No, but it and play with friends OP try horizon chase turbo to NFS since you can't play a difficult racing game."], ["**I'll disagree here. I bought The Crew 2 on sale and thought it was a great buy.**\n\nIt ran fine on my rather mediocore machine (1 crash in 20hrs?) and 580 Radeon.\n\nThe handling isn't amazing but I expected it to leans towards arcade/NFS.... did  *anyone* who watched the trailer where a plane transforms into a car expect super sim realism?\n\nI enjoyed the huge range of vehicles and events (motorcross, rally, air race, acrobatics, jet boat) but if you just spammed street races then yes, I would expect you to have less content.\n\nFinally, earning money wasn't an issue at all. I mean, 15k for merely placing 3rd = buying a 75k car every 5 races (you neglected to mention each race takes 2mins max).\n\nI mean, a new car every 10min isn't hard ffs.  Even 14 races is under 30min.\n\nYes, there are some hypercars north of 700k....  but endgame items which can be \"ground\" in under 1.5hrs of play doesn't seem extreme. The wide range of events made it un-grindy as merely by trying out new events and tracks I could quickly afford expensive toys (I seldom repeated a race).\n\nI think the Crew 2 fails as live service, and has limited replayability (I doubt I'll go past 40hrs as at the 25hr mark it is already feeling bare) but I feel your criticisms are a  bit off base. Certainly, **at $11 TC2 is a steal in terms of $ per hour.**"], ["this guy isno good for reddit he cant say the game is bad cause he could never make anything like the crew 2 plus i love the game and dont be mad and the devs worked hard on that game so stop being like that a game is hard to make."], ["You should buy the crew 2, the game is awesome but this person is shitting on it for no reason."], ["Have to disagree. The Crew 2 was always a big running gag for me and my friends but we picked it up not too long ago for around 15 Bucks (including the Season Pass). And I have to admit we where pleasantly surprised. The Game does still have Issues and the Map was heavily downgraded from the first Game but the driving Experience is really good.\n\nI can't complain about Monetization either. In the time we played we nether bad the urge to shortcut anything, we where able to get all the Cars we wanted in decent time (I was able to get the most expensive Car in the Game in less than 2 Hours of playing). Customization is not bad either, while Visual Customization is not very in depth it does its job and there is also Performance Customization where you can really adjust the Cars Handling and Assists to your liking.\n\nThe races themselves are somewhat lacking, while they are all fun thanks to the driving physics (especially the drifting discipline imo) none of the Tracks are really special so I just wish tbere where more of them. Ai is also always a hit or miss. Either they are Kilometres behind you or they Rubberband you to death... Usually the first. \n\nIn my opinion, if you like Racing Games and you can get it for cheap a must have."], ["What are you talking about? Im pretty Sure the Crashes are Just Happening because of your shitty PC . I have never Had a Crash on ps4. You can afford new Cars easily Just by playing a few races. Of course your Not supposed to buy a lambo right away And the Menus are understandble. Also its Just fun to Drive around and visit different cities. The only Thing Bad about this Game imo are the driving physics but i guess that might only be my Problem since i play with a g29 and shifter and i Play More realistic racing Games Most of the time."], ["1part buy ?"], ["Yea, Forza is a lot better game."], ["Yep just buy the first one. I loved that game and also made the mistake of getting the crew 2 during this sale."], ["Instead buy forza horizon it’s way better\n\nEdit due to mistype"], ["Really? I don’t think mine has crashed at all. But yes i do agree it is pretty lackluster, especially compared to TC1"], ["[deleted]"], ["What can I buy that is not Forza !? Im on PS4"], ["If you want smth similar to the Crew 2 but a lot better, Forza Horizon 4 is probs the way to go."], ["Forza Horizon 4 all the way my dude"], ["I hear good things about Forza, if you're into street racing check out Forza Horizon 4, if you prefer track then Forza Motorsport :) If you only have a PS4 then Gran Turismo. I also enjoyed the 2012 Need For Speed Most Wanted, and they're also remastering Hot Pursuit"], ["For street racing, go with Forza Horizon 4. Plenty of fun, easily accessible via controller, customization isnt perfect but gets the job done\n\n\nFor track racing, Forza Motorsport 8 (or whatever the most recent one is). Same engine as Horizon, but with all the famous race tracks and more + a more \"serious\" collection of cars.\n\n\nMy personal reccomendation? F1 2020. It takes a moment to get used to it, but once yoh do it becomes an absolute blast to play. The driving is buttery smooth, the systems have the potential to be pretty damn complex, and you rarely feel like mistakes werent your fault. A lot of thought was put in to the game outside of just driving too, so you dont feel like it's just a collection of races."], ["The Crew 1 is amazing. Haven't played in a while now so I don't know how alive it is but it's easily my favourite racer of the ones I've played"], ["BeamNG.Drive, Forza Horizon 4, Need for Speed Heat, or maybe Art of Rally"], ["Need for speed heat is another option, incase you're into illegal street racing"], ["Arcade? Forza Horizon 4\n\nSimulator? Assetto Corsa (Game itself is good, what makes it amazing is the modding community; there are thousands of cars and hundreds of tracks)\n\nI can also recommend F1 2020 if you like F1, Dirt Rally 2 if you like Rally, Project Cars 2 isn't bad either."], ["I’ve had a lot of fun with the Dirt games. You can get Rally, 2.0, and 4 bundled on steam on sale for $20 right now, or just dirt 4 for about $6.50."], ["Project cars 2"], ["FH4 on Game Pass"], ["Forza Horizon 4. Bit of a shit UI, but man, so much fun. Very little grind either, you can basically start getting spicy cars after the first few races. Love this game, cant spruik it enough."], ["Nfs heat was pretty good"], ["Forza horizon 4, NFS Heat which I found a lot better to be than I was expecting, maybe try out the new Dirt coming out if you’re into rallyesque type of things."], ["Gran turismo sport is awesome despite the hate it originally got."], ["Forza Horizon 3 and 4, Assetto Corsa if you want a simulator."], ["Best arcade racing game it's GTA V and it's not even a racing game"], ["Forza Horizon 4"], [" Not really; I’m not a race-ist 🤣\n\nI’ll see myself out..."], ["Forza horizons 4 is definitely a fun game I’ve been playing this since this march before coming back to the crew 2, I’ve currently gotten 199 hours driven  and no where near being done."], ["Forza is on the gamepass if you own pc or xbox. It looks amazing and feels amazing."], ["The game requires some grinding, but nfs heat is fun, lots of customization in the car and truly amazing community uploaded paint jobs, though just know that like everything internet, you can find pretty weird thing"], ["Need for Speed Heat. A back to form NFS with probably the coolest presentation and UX/UI design."], ["The Crew 1 still holds up"], ["Midtown madness 3"], ["Forza horizon"], ["Forza Horizon 4 is an amazing game but strictly online, if you want an offline experience as well I suggest NFS HEAT"], ["Forza Horizon 4 is best and most beautiful racing game in this reality"], ["Gran Turismo"], ["Forza Horizon 4 is the best fun I had since NFS Most Wanted 2005. \n\n* It may not have a visual tuning (only some cars have premade 1 or rarely 2 bodykits) but paintjobs are insane good customization.\n* It has every car you can imagine and then a hundred more on top of it.\n* It is VERY accessible, it has no content limited behind grind or leveling system\n* It is extremely content rich if you want to do everything, beautiful with 4 different seasons changing on real weekly basis (you get an introduction offline session for a couple of hours that quickly goes through all 4 so you can see them all)\n* The driving model is amazing and sits on the golden middle path of easy to get into arcade and \"but damn I have to pay attention because these ain't no toy cars and I can screw up easily\" for those perfect turns.\n* BEAUTIFUL graphics with a terrific good optimization.\n* Actually enjoyable, life is great and have fun and have a good day attitude radios that are a joy to drive to. HEAR IT EA? THIS IS HOW YOU DO IT YOU JADEN SMITH GOKU TRASH.\n* Only it doesn't quite have that illegal racing edgy attitude but you can still drive through everything including some stone walls so really, it's there. \n* Plus there are some illegal night racing in it in one of the racing series but it's not that good compared to the rest.\n* It has an AI that allegedly learning the way players drive. Your AI opponents wear random players' names so you always have the illusion that you are playing with other people in races, and they do indeed pull some things that I'm pretty sure they picked up from players. Still they are mostly AI but that background feeling is somehow there. Could be placebo but who cares it's awesome. \n\nOnly the DLCs kinda suck.\n\n* LEGO world racing stuff. Mehh I don't want that in my real world racing game. There are premade lego cars, a couple, so don't expect building your own.\n* A treasure island with challenges leading to millions of cash each that'll make you never have to race for cash ever again. Arguably pay for ingame cash DLC but earned through content."], ["Not as good as horizon 4 but need for speed heat is a bit of a return to form for that franchise"], ["For purely racing so no open world I would recommend Project CARS 3"], ["Project cars 2 is a great racing game"], ["The crew 2"], ["I started playing TC this year, because of Covid. I loved it too. Then I was seriously thinking of getting TC2, especially with Epic vouchers. So I watched a few YouTube vids about it... Baffled until this day, what was Ubisoft thinking???"], ["Ha I played the Crew 2 when it was on a free weekend. I just wanted to explore the map. Best way to experience the game imo"], ["I guess it's easy when the game isn't crashing, then again I didn't play too much of it lol"], ["Ubisoft games always have terrible driving. When I played The Crew (first one) it felt just as bad as Watchdogs or Wildlands. I don't know why a studio known for shit driving would make a racing game. It's baffling."], ["it be like... \"I'M TURNING! WHY AM I NOT TURNING? Okay, hit the hand brake.... well now I'm doing a donut, whoop-de-fuckin-doo\"\n\nXD"], ["I'm glad you enjoyed it! I guess it just wasn't quite my taste, the crashes didn't help"], ["fair points, I never played enough to get to all of those events, but I can understand how the game can be fun too. There was a vintage race of sorts that felt really good, and I enjoyed swapping between vehicles. Overall, it felt like a stainless steel kind of game: shiny and polished, but nothing groundbreaking or fantastic. The crashes also really put the game in a bad light for me, otherwise I'm pretty sure I would have enjoyed it a lot more. I must disagree with you on the interface, it seems unnecessarily complicated to me, and half the default control mapping makes no sense"], ["Agreed. The only fun part was to fly on a plane all the way up and fall as a car"], ["Last time i checked NFS played like a mobile Game. Is there a newer one with good Gameplay?"], ["true that, they brag about having all the important parts of America there but it feels so empty. I don't live in America but it really felt like all the buildings were the same and I never felt like I was in a major American city, or racing down the Florida keys. Those epic cinematic \"wow!\" moments just weren't there."], ["I agree with you. I like a bit of grind in games where you do stuff like collectibles or finding stuff but not to the point where you have to grind in order to progress through the game. Usually in games after grinding for something you get some sort of reward but in the Crew 2 it is mainly to progress though the game."], ["Happy cake day! And yes, I admit I was kinda triggered lol. I can see why you enjoy it so much, but I play a lot of grindy games.When I play a racing game, I'm kind of hoping just to take a load off and have a bit of fun driving around without too much worry. I guess C2 just wasn't the game for me? lol."], ["well it isn't top of the range, so yes"], ["Mario Kart? I'm not so great at this lol\n\n\nBUT if you have a PC, you have **got** to check out Blur. It's very Mario Kart but with real cars, give it a look ;)"], ["#Pressing Y opens the radio menu whaaaat??????\n\nI was so confused when that happened when I hit Y\n\nAlso it seems to run perfectly on console"], ["I did have fun in some parts, but a lot of it just frustrated me. If I had a console I would have probably enjoyed it a lot more than I did"], ["you got me, I actually really do like the FC5 music. It just sounded like they reused it in TC2 and that made me upset"], ["[deleted]"], ["I have to second this, u/Syixice are you sure your Game is not just crashing because you are above specified VRAM Limits, playing on Outdated Drivers or vice versa. Also loading Screens are fine. around a Minute on HDD and not even worth talking about on SSD. This whole Posts sounds more like either your Hardware or Windows Configuration are creating some serious Issues."], ["[deleted]"], ["[deleted]"], ["I can vouch for this. It's available on PC and xbox and totally worth every penny. Its also free on xbox gamepass."], ["H4 is so damn good. I don't even like racing games"], ["I played a ton of Gran Turismo 2, which had you start out racing Ford Focuses and Dodge Neons and passing driving tests.\n\nIs there any PC game that recreates that kind of career?"], ["Just beware if you’re gonna buy it for a wheel, the ffb is AWFUL."], ["I have forza horizon 3 and 4 and both are extremely fun , the only problems is that the maps are pretty small and in mid game it's not that fun cause you cant get that much cash cause there is nothing to do, other than that it's fun."], ["Yeah. Forza is probably the best one. Any of the Horzion ones"], ["Forza does crash too but it's playable and a lot of fun"], ["If Forza 4 the one set within the UK?"], ["and the Hot Pursuit Remaster releases in like 2 weeks which is very nice."], ["had crew 2 when i was on ps it was fun with friends and id say its worth the 11$ its not great and moving to pc i have to say forza is 200x better but if uve already completed nfs heat theres nothing else u can play on ps \nnfs heat is a huge recomendation for ps users"], ["This! I actually really enjoyed F1 (much more so than the real thing) but it gives you a better appreciation of what it takes. Also a fantastic Codemasters Game is Dirt Rally 2.0.  Holy cow, that game blew me out for it's realism and what it demands of you as a virtual driver."], ["The Crew 1 used to be my favorite open world racing game. I could just drive around for hours. I'm not sure what they did in 2 but it doesn't feel anywhere near as good even tho many people suggest it plays better."], ["[deleted]"], ["True. U get ton of wheel spibs and gifts when you start"], ["Facts. Forza is def better but if u want arcade type gta Is by far the best"], ["I think what bothers me most about The Crew 2 is that my favourite part of The Crew is just driving around and discovering places, but they got rid of the map feature that colours in the map for places you’ve been and routes you’ve taken. You can’t find old vehicles lying around anymore, fast travel between cities is severely limited, and many of the great mini games from the first game simply aren’t there anymore. That being said, I’m glad it was an enjoyable experience for you!"], ["It has Never crashed for me on Ps4"], ["[deleted]"], ["I had the first The Crew, but it happened something similar.  I made an upgrade in the car, but I couldn't control it, I literally broke the car.  I couldn't go fast because if I just turned a littlebit, the whole car would go crazy."], ["No crashing for me (i7-9700k GTX1080ti 16gb Win10)"], ["Fair enough - your analogy is kinda correct. I just think that it's a good game to introduce people to more serious racing games. The events and races are laid out very clearly, you know what you've done and what you still have to do, and you can even test drive vehicles. I feel like the biggest comparision done for this game is with Forza Horizon 4, and while that game is definitely better, it's also much more complex for a newer player. As someone who played FH4 after playing TC2, I was a bit lost while trying to figure out which races I could and couldn't do, and what difference the parts swapping made other than the visible class changes from D all the way to X. In that sense, TC2 is much more welcoming and chill for new people."], ["That's probably 90% of my playtime"], ["no.... :("], ["Yeah nfc is kinda downhill too now but better than the crew, the one before heat is pretty good"], ["I kinda feel the same about that game. On ps4, there is a free demo from which you get the whole game for 4 hours. I didn't play the while story since I actually wanted to buy the game so just free-roamed around the map. Well, all I can say is wow when I realesed there is the whole america to drive around. Although I later realized it was more quantity than quality. I don't live in America myself but all the building looked kinda similar. Some of the cities felt like they have no life in them and I was just not excited about that. Of course I didn't expect the whole america to be on a 1 to 1 atomic scale but I expected more quality than quality. Anyway I didn't buy the game. I thought of getting it because I love the street racing genre but I guess I will stick with need for speed (am on ps4 btw). Also when I started the game I was just confused about the whole UI too eith so many menus and ther ewas no tutorial or guide on what all the menu mean too. Thanks for your post."], ["Yep, agreed. I still find myself going back to the original crew with friends rather than playing the second one. The first one was incredibly underrated imo, I don’t think I even played it until it was on sale for like £10 on PlayStation store and it was brilliant. That’s why it hurts so much that the second one was actually a step backwards when I was so excited for it. I even bought the gold edition of the crew 2 because I thought I’d be playing it as much as the first. I also wasn’t a fan of the boats and planes, they should’ve just stuck to cars imo"], ["This is a good game for that. The most fun I have is driving cars like rx7 and mx5 around the map. There’s not a lot of grind necessary for that. But well, triggered or not, ubi could’ve done a lot better with this game."], ["The amount of times I’ve pressed Y then forgotten to close the menu during a race and trying to use nitrous, but the restart the race is annoying."], ["But no the crew 2 is not good. I loved the first crew and I am not at all a fan of car games. My least favorite genre not at all a fan but I absolutely loved the crew."], ["The Car I was talking about is the Bugatti Divo which belongs to the Top Tier Cars of the Hyper Car Class together with the Agera, Carrera Green and some others (you might be able to find the Tier list on the Crew Subreddit). Don't think you should be getting banned for shortcutting, or at least I never heard of it since everyone does it in longer Races."], ["nah, I have 8GB of VRAM and I update my drivers every month. My card may be a little old, but it runs literally everything else fine. I could even run Metro Exodus on high perfectly fine. Furthermore I'm pretty sure I'd notice the framerate drop, but I appreciate the advice anyway :)"], ["Yeah it does. Also isnt it obvious that you arent supposed to get lambo at the start at the Game?"], ["It’s been out for years"], ["[deleted]"], ["What? Forza is on pc??"], ["Forza Horizon or Forza Motorsport. Maybe Dirt if you want offroading."], ["Not to the same extent no. I loved GT for that, buying a crappy 1.2 fezzy off the second hand car market, upgrading, licenses etc. Most games don't even have second hand markets, never mind multiple engines/trim levels for each car."], ["Yeah it’s set in Scotland"], ["wait, REALLY?"], ["> I'm not sure what they did in 2 \n\nI feel like they tried to introduce too much and in doing so the game lost its charm. \n\nI played Crew 2 during the free weekends and even at $12 it felt like too much when it gets repetitive and stale only a few hours in."], ["I see what you mean, but in my opinion it was my first time in the need for speed series and it was really refreshing to play a game that has proper customisation rather than just the odd forza bodykit preset on horizon 3/4. The storyline is alright but could be just a tad longer and could do with some goddamn toyotas but that's all.\nRemember these are just opinions :)"], ["Is it still $60?"], ["I'd say NFS is arcady too and it's actually more of a racing game than Gta"], ["You don't crash just because the settings are too high... You obviously don't know enough about pc gaming to be calling it out"], ["it's probably the shitty Radeon drivers\n\nedit: that I have *"], ["Yes. I didn't buy the game, I played the demo and that was the majority of the time I spent"], ["They are re-releasing Hot Pursuit are they not, maybe that will be good."], ["[deleted]"], ["but then why do you shove it in your face every time you open the game? So that you buy it with real money so you can get it in the beginning of the game"], ["[deleted]"], ["[deleted]"], ["Yes. Even Horizon 3 is"], ["Yes, just in the Windows Store which everyone forgets about, thanks to the amazing design of it..  ͡ ͜ʖ ͡"], ["FH3/4 and FM7 are on PC, yes."], ["First game i downloaded after getting gamepass."], ["It is, but a lot of people, including me, can't even start it. I could start in when I got it with the xbox pc game pass, after buying the Ultimate Edition, I couldn't play it anymore. FH4 is awesome, but a waste of money if you can't play it like me. I was not allowed a refund as well."], ["Yeah, all newer Xbox games are also on PC"], ["Forza horizon 4 AND Forza 7 are included with game pass."], ["Yes and it’s amazing"], ["It's on the XBox Game Pass too, which you can use to play the library on PC as well"], ["Everything that's on Xbox is on PC now"], ["This or the F1 games. You don’t switch cars ever, but you upgrade the same car over the course of the game. F1 2019 is the closest thing to a CaRPG I’ve ever seen."], ["Just Scotland? No English regions at all?"], ["[yes.](https://i.imgur.com/xDwaQit.jpg)"], ["I mean, you can definitely crash from over tuning your settings, it's just usually one of the last things causing issues"], ["Yeah they're remastering it, I hope that'll be good. I'd love a most wanted remaster in the future"], ["rocking that 5G lifestyle and I use windows defender, chances are it's Radeon's shitty drivers. Most crashes seem to be related to that. Oh and I have an i7k 8th gen so yeah... I'm trying to save up for a 3070, maybe a 2070 but I'm not that desperate yet"], ["Yeah except it was a full 60 dollar release from Ubisoft. It had an early access beta."], ["But be quick because its going off sale soon"], ["Can you not get it on the Xbox app? It's far better than the store."], ["Or buy a key for less than that on sites like gamivo or instant gaming"], ["The game I bought gamepass for."], ["That's not true there's only a select few games on the gamepass and play anywhere, a lot of games are some on both platforms but there's still some you can't get on pc"], ["You do switch cars if you switch teams, and they have unique interiors and performance characteristics with each team"], ["I know this comment is old but it is set in Edinburgh, Scotland. No English regions I believe."], ["Holy shit!!!!  \n\\*looks at gameplay footage\\*\n\nOh.\n\nClassic EA, labeling what's clearly a rerelease plus some extra flares a \"remaster\". Glad it exists though"], ["Not when a crash is after 40 minutes though... And if it were to crash you'd know exactly what the problem was because you'd have < 5FPS the entire time before it happened, even then its unlikely, it'd just look like a slideshow. I remember playing Minecraft on an old Intel GMA laptop, it got between 1-3 FPS, and even some of them were blank frames, but never a crash because of it. Maybe a softlock if there's a lot of physics events but again, you'd know about it because of huge lag spikes"], ["It's already gone, unfortunately."], ["Yes. Not sure why people still mention the windows store."], ["Hm, not familiar with these, thanks!"], ["Samesies. Even forza Motorsport was added recently but not my cup of tea. Oh even flight sim is there, the latest one."], ["Eh.. They legit did not announce a single exclusive for Series X since Microsoft decided that their games would be Microsoft exclusive, not Xbox exclusive... That's why you get Halo, Forza, Gears, Sea of Thieves or Sunset Overdrive on PC.. Only a few games which are \"console exclusive\" are just on Xbox and PS like f.e. the UFC games.. That's what I meant by \"now\""], ["Ahh, I see."], ["Well, we don't know yet for certain.\n\nI almost feel like a refresh of assets to 4k and uncapped frames, maybe even HDR support would be all that this game really needs.\n\nI swear if they touch the feel of the game, I'm gonna be mad."], ["Got it on the last day for 10$"], ["[removed]"], ["Any excuse to bash windows."], ["Just be aware, if the price seems too good to be true, they are probably shady. I don't know anything about those sites either, but if the prices seem really low, it might be because they are reselling keys bought through credit card fraud, like what G2A does. For reference, game developers have said that they would prefer that people pirate their games than buy from a shady key reseller, because the latter can actually cost them money."], ["Flight Sim feels like the first true 'next-gen' game, even though it's only on PC at the moment.  If you have a PC that can handle it, it is pretty damn cool, and a relaxing game to play while putting on a podcast while you explore the entire earth!"], ["Exclusives sure but there's still a bunch of other non exclusive games that aren't on PC. Xbox game pass is still better than the PC version"], ["Me too (well, a few days before it ended)."], ["Ay, one of those. My apologies, savvy?"], ["Sorry rogue_crab, your submission has been removed:\r\n\r\nYour post was removed for the following reason:  \r\n> Rule 6: You may not suggest in any way to illegally obtain a game. While we do not care to pry into your own personal decision, we will not allow you to tell others to emulate, torrent, pirate, or in any other way get a hold of a game without legal consent of the producer.\r\n\r\n\r\n\r\nIf you would like to appeal, please [message the moderators.](https://www.reddit.com/message/compose?to=/r/shouldibuythisgame) Thanks!"], ["Not to bash, just way too much Steam.. :)"], ["How would it cost the developers money when you purchase from a shady site rather than pirates? What is the difference between the two?"], ["If someone has their credit card information stolen and used to buy a bunch of game keys, then the most likely thing that will happen when the card holder finds out is to have their bank issue a chargeback to the seller. The problem is that chargebacks have fees associated with them, so it's not a matter of the dev just having to refund the cost of the game, it actually costs them more than they made from the sale.\n\nGranted, the final buyer isn't directly costing the game dev money by buying the stolen key, but nothing encourages more theft than buying stolen goods."]]